'''print("Hello")
print('Hello')
print(123, end=' ')
print(123.2354)'''
#print(True)
#print(True, 123, "Hello", sep='_#_')

# a..z, A...Z, 0...9, _

# int
# float
# str
# bool


'''a = int(input("a = "))
b = int(input("b = "))
s = a * b

print(f"Площа прямокутника зі сторонами а = {a}, b = {b}, буде {s}")'''


# -
# = , + , - , * , / , += , -= , *= , /= , **= , // , %


'''a = 5
b = 4
#a = a + b
a += b
a = 3 % 5'''


# Даны три точки A, B, C на числовой оси. Найти длины отрезков AC
# и BC и их сумму.


'''A = int(input("A = "))
B = int(input("B = "))
C = int(input("C = "))

AC = abs(A-B)
BC = abs(C-B)

print(f"AC = {AC}")
print(f"BC = {BC}")
print(f"AC + BC = {AC + BC}")'''


# Даны координаты двух противоположных вершин прямоугольника:
# (x1, y1), (x2, y2). Стороны прямоугольника параллельны осям координат.
# Найти периметр и площадь данного прямоугольника.

